# Web scrapping standings data
This notebook is for the testing of code for web scrapping the standings data by date from [Basketball Reference](https://basketball-reference.com)

In [1]:
# Import packages for reading html off the website
import requests
from bs4 import BeautifulSoup
from contextlib import closing

In [46]:
#Setup some basic parameters
base_url = 'https://www.basketball-reference.com'
season_end_year = 2013
conference = 'eastern'

url = '{base_url}/leagues/NBA_{season_end_year}_standings_by_date_{conference}_conference.html'.format(
    base_url = base_url, 
    season_end_year = season_end_year, 
    conference = conference
)

print(url)

https://www.basketball-reference.com/leagues/NBA_2013_standings_by_date_eastern_conference.html

## Pandas library
The pandas package includes a `read_html` function that can take in the url of the standings by date and covert it to a `DataFrame` and could forego the complications of writing my own webscrapping function.

In [47]:
import pandas as pd

In [48]:
dfs = pd.read_html(url, index_col=0, parse_dates=True)
dfs

[October            October                                            \
                        1st           2nd           3rd           4th
 Oct 30, 2012  CLE (1-0) T1  MIA (1-0) T1  BOS (0-1) T3  WAS (0-1) T3
 Oct 31, 2012  CHI (1-0) T1  CLE (1-0) T1  IND (1-0) T1  MIA (1-0) T1
 November          November      November      November      November
 NaN                    1st           2nd           3rd           4th
 Nov 1, 2012   CHI (1-0) T1  CLE (1-0) T1  IND (1-0) T1  MIA (1-0) T1
 ...                    ...           ...           ...           ...
 Apr 13, 2013   MIA (63-16)   NYK (52-27)   IND (49-30)   BRK (47-32)
 Apr 14, 2013   MIA (64-16)   NYK (53-27)   IND (49-31)   BRK (47-33)
 Apr 15, 2013   MIA (65-16)   NYK (53-28)   IND (49-31)   BRK (48-33)
 Apr 16, 2013   MIA (65-16)   NYK (53-28)   IND (49-31)   BRK (48-33)
 Apr 17, 2013   MIA (66-16)   NYK (54-28)   IND (49-32)   BRK (49-33)

 October                                                                   \
                          5th             6th           7th           8th
 Oct 30, 2012             NaN             NaN           NaN           NaN
 Oct 31, 2012    PHI (1-0) T1    BOS (0-1) T6  DET (0-1) T6  TOR (0-1) T6
 November            November        November      November      November
 NaN                      5th             6th           7th           8th
 Nov 1, 2012     PHI (1-0) T1    BOS (0-1) T6  DET (0-1) T6  TOR (0-1) T6
 ...                      ...             ...           ...           ...
 Apr 13, 2013     ATL (44-36)     CHI (43-36)   BOS (41-39)   MIL (37-43)
 Apr 14, 2013     ATL (44-36)     CHI (43-37)   BOS (41-39)   MIL (37-43)
 Apr 15, 2013     ATL (44-36)     CHI (44-37)   BOS (41-39)   MIL (37-44)
 Apr 16, 2013  ATL (44-37) T5  CHI (44-37) T5   BOS (41-39)   MIL (37-44)
 Apr 17, 2013     CHI (45-37)     ATL (44-38)   BOS (41-40)   MIL (38-44)

 October                                                        \
                          9th            10th             11th
 Oct 30, 2012             NaN             NaN              NaN
 Oct 31, 2012    WAS (0-1) T6             NaN              NaN
 November            November        November         November
 NaN                      9th            10th             11th
 Nov 1, 2012     WAS (0-1) T6             NaN              NaN
 ...                      ...             ...              ...
 Apr 13, 2013     PHI (32-47)     TOR (31-48)      WAS (29-51)
 Apr 14, 2013     PHI (33-47)     TOR (32-48)      WAS (29-51)
 Apr 15, 2013     PHI (33-48)     TOR (32-48)  DET (29-52) T11
 Apr 16, 2013  PHI (33-48) T9  TOR (33-48) T9  DET (29-52) T11
 Apr 17, 2013  PHI (34-48) T9  TOR (34-48) T9  DET (29-53) T11

 October
                          12th         13th             14th             15th
 Oct 30, 2012              NaN          NaN              NaN              NaN
 Oct 31, 2012              NaN          NaN              NaN              NaN
 November             November     November         November         November
 NaN                      12th         13th             14th             15th
 Nov 1, 2012               NaN          NaN              NaN              NaN
 ...                       ...          ...              ...              ...
 Apr 13, 2013      DET (28-52)  CLE (24-55)      ORL (20-60)      CHA (19-61)
 Apr 14, 2013      DET (28-52)  CLE (24-56)      ORL (20-60)      CHA (19-61)
 Apr 15, 2013  WAS (29-52) T11  CLE (24-57)  CHA (20-61) T14  ORL (20-61) T14
 Apr 16, 2013  WAS (29-52) T11  CLE (24-57)  CHA (20-61) T14  ORL (20-61) T14
 Apr 17, 2013  WAS (29-53) T11  CLE (24-58)      CHA (21-61)      ORL (20-62)

 [182 rows x 15 columns]]

In [49]:
len(dfs)

1

In [50]:
dfs[0]

October            October                                            \
                       1st           2nd           3rd           4th
Oct 30, 2012  CLE (1-0) T1  MIA (1-0) T1  BOS (0-1) T3  WAS (0-1) T3
Oct 31, 2012  CHI (1-0) T1  CLE (1-0) T1  IND (1-0) T1  MIA (1-0) T1
November          November      November      November      November
NaN                    1st           2nd           3rd           4th
Nov 1, 2012   CHI (1-0) T1  CLE (1-0) T1  IND (1-0) T1  MIA (1-0) T1
...                    ...           ...           ...           ...
Apr 13, 2013   MIA (63-16)   NYK (52-27)   IND (49-30)   BRK (47-32)
Apr 14, 2013   MIA (64-16)   NYK (53-27)   IND (49-31)   BRK (47-33)
Apr 15, 2013   MIA (65-16)   NYK (53-28)   IND (49-31)   BRK (48-33)
Apr 16, 2013   MIA (65-16)   NYK (53-28)   IND (49-31)   BRK (48-33)
Apr 17, 2013   MIA (66-16)   NYK (54-28)   IND (49-32)   BRK (49-33)

October                                                                   \
                         5th             6th           7th           8th
Oct 30, 2012             NaN             NaN           NaN           NaN
Oct 31, 2012    PHI (1-0) T1    BOS (0-1) T6  DET (0-1) T6  TOR (0-1) T6
November            November        November      November      November
NaN                      5th             6th           7th           8th
Nov 1, 2012     PHI (1-0) T1    BOS (0-1) T6  DET (0-1) T6  TOR (0-1) T6
...                      ...             ...           ...           ...
Apr 13, 2013     ATL (44-36)     CHI (43-36)   BOS (41-39)   MIL (37-43)
Apr 14, 2013     ATL (44-36)     CHI (43-37)   BOS (41-39)   MIL (37-43)
Apr 15, 2013     ATL (44-36)     CHI (44-37)   BOS (41-39)   MIL (37-44)
Apr 16, 2013  ATL (44-37) T5  CHI (44-37) T5   BOS (41-39)   MIL (37-44)
Apr 17, 2013     CHI (45-37)     ATL (44-38)   BOS (41-40)   MIL (38-44)

October                                                        \
                         9th            10th             11th
Oct 30, 2012             NaN             NaN              NaN
Oct 31, 2012    WAS (0-1) T6             NaN              NaN
November            November        November         November
NaN                      9th            10th             11th
Nov 1, 2012     WAS (0-1) T6             NaN              NaN
...                      ...             ...              ...
Apr 13, 2013     PHI (32-47)     TOR (31-48)      WAS (29-51)
Apr 14, 2013     PHI (33-47)     TOR (32-48)      WAS (29-51)
Apr 15, 2013     PHI (33-48)     TOR (32-48)  DET (29-52) T11
Apr 16, 2013  PHI (33-48) T9  TOR (33-48) T9  DET (29-52) T11
Apr 17, 2013  PHI (34-48) T9  TOR (34-48) T9  DET (29-53) T11

October
                         12th         13th             14th             15th
Oct 30, 2012              NaN          NaN              NaN              NaN
Oct 31, 2012              NaN          NaN              NaN              NaN
November             November     November         November         November
NaN                      12th         13th             14th             15th
Nov 1, 2012               NaN          NaN              NaN              NaN
...                       ...          ...              ...              ...
Apr 13, 2013      DET (28-52)  CLE (24-55)      ORL (20-60)      CHA (19-61)
Apr 14, 2013      DET (28-52)  CLE (24-56)      ORL (20-60)      CHA (19-61)
Apr 15, 2013  WAS (29-52) T11  CLE (24-57)  CHA (20-61) T14  ORL (20-61) T14
Apr 16, 2013  WAS (29-52) T11  CLE (24-57)  CHA (20-61) T14  ORL (20-61) T14
Apr 17, 2013  WAS (29-53) T11  CLE (24-58)      CHA (21-61)      ORL (20-62)

[182 rows x 15 columns]

In [51]:
dfs[0].index

Index(['Oct 30, 2012', 'Oct 31, 2012',     'November',            nan,
        'Nov 1, 2012',  'Nov 2, 2012',  'Nov 3, 2012',  'Nov 4, 2012',
        'Nov 5, 2012',  'Nov 6, 2012',
       ...
        'Apr 8, 2013',  'Apr 9, 2013', 'Apr 10, 2013', 'Apr 11, 2013',
       'Apr 12, 2013', 'Apr 13, 2013', 'Apr 14, 2013', 'Apr 15, 2013',
       'Apr 16, 2013', 'Apr 17, 2013'],
      dtype='object', length=182)

In [52]:
dfs[0].columns

MultiIndex([('October',  '1st'),
            ('October',  '2nd'),
            ('October',  '3rd'),
            ('October',  '4th'),
            ('October',  '5th'),
            ('October',  '6th'),
            ('October',  '7th'),
            ('October',  '8th'),
            ('October',  '9th'),
            ('October', '10th'),
            ('October', '11th'),
            ('October', '12th'),
            ('October', '13th'),
            ('October', '14th'),
            ('October', '15th')],
           names=['October', None])

In [53]:
dfs[0].columns = dfs[0].columns.droplevel(0)

In [54]:
dfs[0]

,1st,2nd,3rd,4th,5th,6th,7th,8th,9th,10th,11th,12th,13th,14th,15th
"Oct 30, 2012",CLE (1-0) T1,MIA (1-0) T1,BOS (0-1) T3,WAS (0-1) T3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"Oct 31, 2012",CHI (1-0) T1,CLE (1-0) T1,IND (1-0) T1,MIA (1-0) T1,PHI (1-0) T1,BOS (0-1) T6,DET (0-1) T6,TOR (0-1) T6,WAS (0-1) T6,NaN,NaN,NaN,NaN,NaN,NaN
November,November,November,November,November,November,November,November,November,November,November,November,November,November,November,November
NaN,1st,2nd,3rd,4th,5th,6th,7th,8th,9th,10th,11th,12th,13th,14th,15th
"Nov 1, 2012",CHI (1-0) T1,CLE (1-0) T1,IND (1-0) T1,MIA (1-0) T1,PHI (1-0) T1,BOS (0-1) T6,DET (0-1) T6,TOR (0-1) T6,WAS (0-1) T6,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Apr 13, 2013",MIA (63-16),NYK (52-27),IND (49-30),BRK (47-32),ATL (44-36),CHI (43-36),BOS (41-39),MIL (37-43),PHI (32-47),TOR (31-48),WAS (29-51),DET (28-52),CLE (24-55),ORL (20-60),CHA (19-61)
"Apr 14, 2013",MIA (64-16),NYK (53-27),IND (49-31),BRK (47-33),ATL (44-36),CHI (43-37),BOS (41-39),MIL (37-43),PHI (33-47),TOR (32-48),WAS (29-51),DET (28-52),CLE (24-56),ORL (20-60),CHA (19-61)
"Apr 15, 2013",MIA (65-16),NYK (53-28),IND (49-31),BRK (48-33),ATL (44-36),CHI (44-37),BOS (41-39),MIL (37-44),PHI (33-48),TOR (32-48),DET (29-52) T11,WAS (29-52) T11,CLE (24-57),CHA (20-61) T14,ORL (20-61) T14
"Apr 16, 2013",MIA (65-16),NYK (53-28),IND (49-31),BRK (48-33),ATL (44-37) T5,CHI (44-37) T5,BOS (41-39),MIL (37-44),PHI (33-48) T9,TOR (33-48) T9,DET (29-52) T11,WAS (29-52) T11,CLE (24-57),CHA (20-61) T14,ORL (20-61) T14
"Apr 17, 2013",MIA (66-16),NYK (54-28),IND (49-32),BRK (49-33),CHI (45-37),ATL (44-38),BOS (41-40),MIL (38-44),PHI (34-48) T9,TOR (34-48) T9,DET (29-53) T11,WAS (29-53) T11,CLE (24-58),CHA (21-61),ORL (20-62)

In [55]:
dfs[0].iloc[3,:]

1st      1st
2nd      2nd
3rd      3rd
4th      4th
5th      5th
6th      6th
7th      7th
8th      8th
9th      9th
10th    10th
11th    11th
12th    12th
13th    13th
14th    14th
15th    15th
Name: nan, dtype: object